In [1]:
#Handling missing data
import numpy as np
import pandas as pd
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [2]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [3]:
string_data[0] = None

In [4]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
#Filtering out missing data
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

cleaned = data.dropna()

data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [8]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [9]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data[4] = NA

data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [12]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
df = pd.DataFrame(np.random.randn(7, 3))

df.iloc[:4, 1] = NA

df.iloc[:2, 2] = NA

df

          0         1         2
0  2.386031       NaN       NaN
1  0.070957       NaN       NaN
2  0.103374       NaN -0.731118
3  0.592831       NaN -0.783793
4 -1.088479  0.687571 -2.339698
5  0.958020 -1.011748 -0.641114
6 -1.025951 -0.218571 -0.843319

In [15]:
df.dropna()

          0         1         2
4 -1.088479  0.687571 -2.339698
5  0.958020 -1.011748 -0.641114
6 -1.025951 -0.218571 -0.843319

In [16]:
df.dropna(thresh=2)

          0         1         2
2  0.103374       NaN -0.731118
3  0.592831       NaN -0.783793
4 -1.088479  0.687571 -2.339698
5  0.958020 -1.011748 -0.641114
6 -1.025951 -0.218571 -0.843319

In [17]:
#Filling in missing data
df.fillna(0)

          0         1         2
0  2.386031  0.000000  0.000000
1  0.070957  0.000000  0.000000
2  0.103374  0.000000 -0.731118
3  0.592831  0.000000 -0.783793
4 -1.088479  0.687571 -2.339698
5  0.958020 -1.011748 -0.641114
6 -1.025951 -0.218571 -0.843319

In [18]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  2.386031  0.500000  0.000000
1  0.070957  0.500000  0.000000
2  0.103374  0.500000 -0.731118
3  0.592831  0.500000 -0.783793
4 -1.088479  0.687571 -2.339698
5  0.958020 -1.011748 -0.641114
6 -1.025951 -0.218571 -0.843319

In [19]:
_ = df.fillna(0, inplace=True)

df

          0         1         2
0  2.386031  0.000000  0.000000
1  0.070957  0.000000  0.000000
2  0.103374  0.000000 -0.731118
3  0.592831  0.000000 -0.783793
4 -1.088479  0.687571 -2.339698
5  0.958020 -1.011748 -0.641114
6 -1.025951 -0.218571 -0.843319

In [20]:
df = pd.DataFrame(np.random.randn(6, 3))

df.iloc[2:, 1] = NA

df.iloc[4:, 2] = NA

df

          0         1         2
0  1.208352  1.890739  0.395324
1  0.687738 -0.015071  0.396842
2  0.887696       NaN  0.333756
3  0.984607       NaN -1.578541
4 -2.054922       NaN       NaN
5 -0.739665       NaN       NaN

In [21]:
df.fillna(method='ffill')

          0         1         2
0  1.208352  1.890739  0.395324
1  0.687738 -0.015071  0.396842
2  0.887696 -0.015071  0.333756
3  0.984607 -0.015071 -1.578541
4 -2.054922 -0.015071 -1.578541
5 -0.739665 -0.015071 -1.578541

In [22]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.208352  1.890739  0.395324
1  0.687738 -0.015071  0.396842
2  0.887696 -0.015071  0.333756
3  0.984607 -0.015071 -1.578541
4 -2.054922       NaN -1.578541
5 -0.739665       NaN -1.578541

In [23]:
data = pd.Series([1., NA, 3.5, NA, 7])

data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64